# RoomTagVolumeNotComputed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomTagVolumeNotComputed Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] Tag is displaying volume that can't be computed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomTagVolumeNotComputed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomTagVolumeNotComputed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomTagVolumeNotComputed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace